.data
    helloString:   .asciiz "hello"
    NewLine: .asciiz "\n"

.text
main:
    
    la $t0 , helloString
   
    # Εμφάνιση του πρώτου χαρακτήρα
    li $v0 , 11               # Φόρτωση του κωδικού της συστημικής κλήσης για εκτύπωση χαρακτήρα στο $v0
    lb $a0 , ($t0)  # Φόρτωση του πρώτου χαρακτήρα του helloString στο $a0
    syscall                   # Κλήση συστήματος για εκτύπωση χαρακτήρα
    
    li $v0 , 4
    la $a0 , NewLine
    syscall
    
    li $v0 , 11
    lb $a0 , 1($t0)
    syscall 

   
    # Έξοδος προγράμματος
    li $v0, 10                # Φόρτωση του κωδικού της συστημικής κλήσης για έξοδο προγράμματος στο $v0
    syscall                   # Κλήση συστήματος για έξοδο προγράμματος